def generator_field(cell: int = 3) -> str:
    """Генерирует шаблон игрового поля соответствующего размера(с фигурными скобками), для отображения"""
    row = '|'.join([' {} ']*cell)
    line = '-'*(cell*4 + (cell-1))
    return (f'\n{line}\n'.join([row]*cell))
    
def generator_field1(cell: int = 3) -> str:
    """Генерирует шаблон игрового поля соответствующего размера, для отображения"""
    row = '|'.join([' {} ']*cell)
    line = '-'*(cell*3 + (cell-1))
    return (f'\n{line}\n'.join([row]*cell))
    
    
empty_dict = dict.fromkeys(range(1,26), ' ')
turns = {5: 'X', 3: '0', 9: 'X'}
board_5 = generator_field1(5).format(*(empty_dict | turns).values())


board_3 = generator_field1(3).format(' ',' ','0',' ','X',' ',' ',' ','X')

# >>> print(generator_field(3))
# {} | {} | {}
#--------------
# {} | {} | {}
#--------------
# {} | {} | {}
 
# >>> print(generator_field(8))
 # {} | {} | {} | {} | {} | {} | {} | {}
# ---------------------------------------
 # {} | {} | {} | {} | {} | {} | {} | {}
# ---------------------------------------
 # {} | {} | {} | {} | {} | {} | {} | {}
# ---------------------------------------
 # {} | {} | {} | {} | {} | {} | {} | {}
# ---------------------------------------
 # {} | {} | {} | {} | {} | {} | {} | {}
# ---------------------------------------
 # {} | {} | {} | {} | {} | {} | {} | {}
# ---------------------------------------
 # {} | {} | {} | {} | {} | {} | {} | {}
# ---------------------------------------
 # {} | {} | {} | {} | {} | {} | {} | {}

# >>> print(board_5)
#   |   | 0 |   | X
#-------------------
#   |   |   | X |
#-------------------
#   |   |   |   |
#-------------------
#   |   |   |   |
#-------------------
#   |   |   |   |

#>>> print(board_3)
#   |   | 0
#-----------
#   | X |
#-----------
#   |   | X
